class Vacancy:
    pass
#Создать класс для работы с вакансиями.
# В этом классе самостоятельно определить атрибуты, такие как
# название вакансии, ссылка на вакансию, зарплата, краткое описание или требования и т. п. (не менее четырех)
# Класс должен поддерживать методы сравнения вакансий между собой по зарплате и валидировать данные,
# которыми инициализируются его атрибуты.
#должен быть реализован в соответствии с принципом инкапсуляции и п
# оддерживать методы сравнения вакансий между собой по зарплате